jcorne23/Driver_Fatigue_System/esp32/app_httpd.cpp

#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"
#include <Arduino.h>
#include <ArduinoJson.h>
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <HTTPClient.h>
//router
const char* RPI_IP = "http://192.168.1.3:5000/startdrive";  // router
const char* RPI_SEND = "http://192.168.1.3:5000";  //other one

//bromley
//const char* RPI_IP = "http://10.8.16.141:5000/startdrive";  //other one
//const char* RPI_SEND = "http://10.8.16.141:5000";  //other one

#define OLED_SDA 4  
#define OLED_SCL 14
#define MQ3_PIN 15

extern Adafruit_SSD1306 display;

// Enable LED FLASH setting
#define CONFIG_LED_ILLUMINATOR_ENABLED 1

// LED FLASH setup
#if CONFIG_LED_ILLUMINATOR_ENABLED

#define LED_LEDC_GPIO            22  //configure LED pin
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct {
  size_t size;   //number of values used for filtering
  size_t index;  //current value index
  size_t count;  //value count
  int sum;
  int *values;  //array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size) {
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values) {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value) {
  if (!filter->values) {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size) {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if CONFIG_LED_ILLUMINATOR_ENABLED
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_LEDC_GPIO, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t start_drive_handler(httpd_req_t *req) {
  HTTPClient http;
  http.begin(RPI_IP);
  int httpResponseCode = http.POST("");

  if (httpResponseCode > 0) {
    Serial.printf("POST success: %d\n", httpResponseCode);

    // POST success, now redirect browser
    httpd_resp_set_status(req, "302 Found"); // Tell browser to redirect
    httpd_resp_set_hdr(req, "Location", RPI_SEND); // Redirect to the driver monitor page
    return httpd_resp_send(req, NULL, 0); // No body needed
  } else {
    Serial.printf("POST failed: %d\n", httpResponseCode);

    // POST failed, tell user it failed
    httpd_resp_set_type(req, "text/plain");
    return httpd_resp_send(req, "Drive session POST failed", HTTPD_RESP_USE_STRLEN);
  }

  http.end();
}


static esp_err_t flash_ui_handler(httpd_req_t *req) {
  const char *html = R"rawliteral(
    <!DOCTYPE html>
    <html>
    <head>
      <title>Flashlight Control</title>
      <meta name="viewport" content="width=device-width, initial-scale=1">
      <style>
        body {
          font-family: sans-serif;
          text-align: center;
          padding: 20px;
        }
        h2 {
          font-size: 1.5em;
          margin-bottom: 20px;
        }
        button {
          width: 90%;
          max-width: 300px;
          font-size: 1.2em;
          padding: 12px;
          margin: 10px auto;
          display: block;
        }
        input[type="number"] {
          width: 80%;
          max-width: 200px;
          padding: 10px;
          font-size: 1em;
          margin-top: 10px;
        }
        label {
          display: block;
          margin-top: 20px;
          font-size: 1em;
        }
      </style>
    </head>
    <body>
      <h2>Flashlight Control</h2>

      <button onclick="toggleFlash('on')">Turn ON</button>
      <button onclick="toggleFlash('off')">Turn OFF</button>

      <label for="brightness">Set Brightness (0–255):</label>
      <input type="number" id="brightness" min="0" max="255" value="128" onkeydown="handleEnter(event)">
      <button onclick="submitBrightness()">Set Brightness</button>

      <script>
        function toggleFlash(state) {
          fetch('/flash', {
            method: 'POST',
            headers: { 'Content-Type': 'text/plain' },
            body: state
          });
        }

        function submitBrightness() {
          let val = document.getElementById('brightness').value;
          fetch('/flash', {
            method: 'POST',
            headers: { 'Content-Type': 'text/plain' },
            body: val
          });
        }

        function handleEnter(event) {
          if (event.key === 'Enter') {
            submitBrightness();
          }
        }
      </script>
    </body>
    </html>
  )rawliteral";

  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, html, HTTPD_RESP_USE_STRLEN);
}

static esp_err_t flash_toggle_handler(httpd_req_t *req) {

  char buf[16];
  int ret = httpd_req_recv(req, buf, sizeof(buf) - 1);
  if (ret <= 0) return ESP_FAIL;

  buf[ret] = 0; // Null-terminate
  log_i("Flash POST received: %s", buf);

  if (strstr(buf, "on")) {
    ledcWrite(4, 255);  // Full brightness
  } else if (strstr(buf, "off")) {
    ledcWrite(4, 0);    // Off
  } else {
    // Parse brightness value
    int brightness = atoi(buf);
    brightness = constrain(brightness, 0, 255);
    ledcWrite(4, brightness);
    log_i("Set brightness to %d", brightness);
  }





  httpd_resp_set_type(req, "text/plain");
  return httpd_resp_send(req, "Flash updated", HTTPD_RESP_USE_STRLEN);
}



